{
  "education": [
    {
      "awards_achievements": [
        "GPA: 3.5/4.0"
      ],
      "degree": "Honours Bachelor of Engineering",
      "department": "Electrical and Computer Engineering",
      "duration": "2015-2020",
      "school_name": "York University"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_KishorSivapalan",
  "highlighted_projects": [
    {
      "description": "Created a design for Arm and Leg Robotics to support Neuro-Rehabilitation. Detailed a Final Documentation which described the product, its purpose, its functions, and the project management aspects of the project. Project was conducted using agile methodologies in a team of 7.",
      "git_url": null,
      "name": "Arm \u0026 Leg Robotics for Neuro-Rehabilitation"
    },
    {
      "description": "Developed a shopping system application using NetBeans IDE; a MySQL server was used for backend development. Detailed a Software Specification document which described the software, its purpose, and its functions. Project was conducted using agile methodlogies in a team of 5.",
      "git_url": null,
      "name": "SmartShoppers System"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Developed and deployed a monitoring agent that records hardware information and resource usage data from a node in a cluster. Project was created using the Linux CLI, Bash scripts, PostgreSQL, Docker and the IntelliJ IDE.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": [
        "JDBC App: Developed and tested a Java app that uses the JDBC API and a DAO design pattern to be able to perform CRUD operations on a database. Project was created using PostgreSQL, Maven, Docker, and the IntelliJ IDE.",
        "Grep App: Developed and deployed a Java app that mimics the functionality of the 'grep' command in Linux. Project was created using the Linux CLI, Maven, Docker, and the IntelliJ IDE."
      ],
      "git_url": "/core_java",
      "name": "Core Java Apps"
    }
  ],
  "name": "Kishor Sivapalan",
  "others": [
    {
      "bullets": [
        "Sports/Athletics/Fitness",
        "Competitive/Casual Gaming",
        "Game Development",
        "Poker/Chess/Board Games",
        "Film/TV"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Designed, tested, and deployed various software projects using Agile and GitFlow methodologies. Other technologies used include: Docker, Maven, Linux/Bash scripting, PostgreSQL, and the IntelliJ IDE. Lead and contributed to daily scrum meetings during each sprint cycle. Performed Master Code Review sessions with a senior developer to verify code quality and background knowledge.",
      "duration": "2022-Present",
      "title": "Software Developer"
    }
  ],
  "skills": {
    "competent": [
      "HTML",
      "CSS",
      "JavaScript",
      "Docker",
      "Maven",
      "IntelliJ IDE",
      "Eclipse IDE",
      "NetBeans IDE"
    ],
    "familiar": [
      "MATLAB",
      "C",
      "Python",
      "Node.js",
      "React"
    ],
    "proficient": [
      "Java",
      "Linux/Bash",
      "RDBMS/SQL",
      "Agile/Scrum",
      "Git",
      "Data Structures"
    ]
  },
  "summary": "Hello, my name is Kishor! I completed my Bachelor's of Engineering degree in Computer Engineering at York University. When I was younger, I had a tendency to build and create things, while also looking at how things are designed. Once my parents introduced me to my first game console, I realised that I wanted to pursue something in the technological field. I wanted to be able to solve real world problems using software which led me down the path to Jarvis. At Jarvis, I worked on several software development projects such as a Linux/SQL resource monitor, and a Java clone of the \"grep\" command in Linux. In doing these projects, I hope to further my career in either full-stack development or quality assurance, with an added interest in project management."
}
